analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/usbhs_regs.h
#define MXC_F_USBHS_INTRINEN_EP3_IN_INT_EN_POS         3 /**< INTRINEN_EP3_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP3_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP3_IN_INT_EN_POS)) /**< INTRINEN_EP3_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP2_IN_INT_EN_POS         2 /**< INTRINEN_EP2_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP2_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP2_IN_INT_EN_POS)) /**< INTRINEN_EP2_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP1_IN_INT_EN_POS         1 /**< INTRINEN_EP1_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP1_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP1_IN_INT_EN_POS)) /**< INTRINEN_EP1_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP0_INT_EN_POS            0 /**< INTRINEN_EP0_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP0_INT_EN                ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP0_INT_EN_POS)) /**< INTRINEN_EP0_INT_EN Mask */

/**@} end of group USBHS_INTRINEN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INTROUTEN USBHS_INTROUTEN
 * @brief    Interrupt enable for OUT EP 1-15.
 * @{
 */
#define MXC_F_USBHS_INTROUTEN_EP15_OUT_INT_EN_POS      15 /**< INTROUTEN_EP15_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP15_OUT_INT_EN          ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP15_OUT_INT_EN_POS)) /**< INTROUTEN_EP15_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP14_OUT_INT_EN_POS      14 /**< INTROUTEN_EP14_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP14_OUT_INT_EN          ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP14_OUT_INT_EN_POS)) /**< INTROUTEN_EP14_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP13_OUT_INT_EN_POS      13 /**< INTROUTEN_EP13_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP13_OUT_INT_EN          ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP13_OUT_INT_EN_POS)) /**< INTROUTEN_EP13_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP12_OUT_INT_EN_POS      12 /**< INTROUTEN_EP12_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP12_OUT_INT_EN          ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP12_OUT_INT_EN_POS)) /**< INTROUTEN_EP12_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP11_OUT_INT_EN_POS      11 /**< INTROUTEN_EP11_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP11_OUT_INT_EN          ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP11_OUT_INT_EN_POS)) /**< INTROUTEN_EP11_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP10_OUT_INT_EN_POS      10 /**< INTROUTEN_EP10_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP10_OUT_INT_EN          ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP10_OUT_INT_EN_POS)) /**< INTROUTEN_EP10_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP9_OUT_INT_EN_POS       9 /**< INTROUTEN_EP9_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP9_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP9_OUT_INT_EN_POS)) /**< INTROUTEN_EP9_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP8_OUT_INT_EN_POS       8 /**< INTROUTEN_EP8_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP8_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP8_OUT_INT_EN_POS)) /**< INTROUTEN_EP8_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP7_OUT_INT_EN_POS       7 /**< INTROUTEN_EP7_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP7_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP7_OUT_INT_EN_POS)) /**< INTROUTEN_EP7_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP6_OUT_INT_EN_POS       6 /**< INTROUTEN_EP6_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP6_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP6_OUT_INT_EN_POS)) /**< INTROUTEN_EP6_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP5_OUT_INT_EN_POS       5 /**< INTROUTEN_EP5_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP5_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP5_OUT_INT_EN_POS)) /**< INTROUTEN_EP5_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP4_OUT_INT_EN_POS       4 /**< INTROUTEN_EP4_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP4_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP4_OUT_INT_EN_POS)) /**< INTROUTEN_EP4_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP3_OUT_INT_EN_POS       3 /**< INTROUTEN_EP3_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP3_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP3_OUT_INT_EN_POS)) /**< INTROUTEN_EP3_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP2_OUT_INT_EN_POS       2 /**< INTROUTEN_EP2_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP2_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP2_OUT_INT_EN_POS)) /**< INTROUTEN_EP2_OUT_INT_EN Mask */

#define MXC_F_USBHS_INTROUTEN_EP1_OUT_INT_EN_POS       1 /**< INTROUTEN_EP1_OUT_INT_EN Position */
#define MXC_F_USBHS_INTROUTEN_EP1_OUT_INT_EN           ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUTEN_EP1_OUT_INT_EN_POS)) /**< INTROUTEN_EP1_OUT_INT_EN Mask */

/**@} end of group USBHS_INTROUTEN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INTRUSB USBHS_INTRUSB
 * @brief    Interrupt register for common USB interrupts.
 * @{
 */
#define MXC_F_USBHS_INTRUSB_SOF_INT_POS                3 /**< INTRUSB_SOF_INT Position */
#define MXC_F_USBHS_INTRUSB_SOF_INT                    ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSB_SOF_INT_POS)) /**< INTRUSB_SOF_INT Mask */

#define MXC_F_USBHS_INTRUSB_RESET_INT_POS              2 /**< INTRUSB_RESET_INT Position */
#define MXC_F_USBHS_INTRUSB_RESET_INT                  ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSB_RESET_INT_POS)) /**< INTRUSB_RESET_INT Mask */

#define MXC_F_USBHS_INTRUSB_RESUME_INT_POS             1 /**< INTRUSB_RESUME_INT Position */
#define MXC_F_USBHS_INTRUSB_RESUME_INT                 ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSB_RESUME_INT_POS)) /**< INTRUSB_RESUME_INT Mask */

#define MXC_F_USBHS_INTRUSB_SUSPEND_INT_POS            0 /**< INTRUSB_SUSPEND_INT Position */
#define MXC_F_USBHS_INTRUSB_SUSPEND_INT                ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSB_SUSPEND_INT_POS)) /**< INTRUSB_SUSPEND_INT Mask */

/**@} end of group USBHS_INTRUSB_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INTRUSBEN USBHS_INTRUSBEN
 * @brief    Interrupt enable for common USB interrupts.
 * @{
 */
#define MXC_F_USBHS_INTRUSBEN_SOF_INT_EN_POS           3 /**< INTRUSBEN_SOF_INT_EN Position */
#define MXC_F_USBHS_INTRUSBEN_SOF_INT_EN               ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSBEN_SOF_INT_EN_POS)) /**< INTRUSBEN_SOF_INT_EN Mask */

